#include <stdio.h>
#include <math.h>
#define MAX pow(10,6)//Ο μέγιστος επιτρεπτός αριθμός γύρων



int main(void){
    char me='D'; //η μεταβλητή me αντιπροωπεύει τις εντολές-αποφάσεις του υπολογιστή 
    char player; //η μεταβλητή player αντιπροσωπεύει τις εντολές-αποφάσεις του αντιπάλου(παίκτη)
    int rounds=0;
    putchar(me);//αρχίζουμε εκτυπώνοντας την εντολή του υπολογιστή την οποία έχουμε αρχικοποιήσει παραπάνω σε D
    putchar('\n');
    fflush(stdout);//με την εντολή fflush επιτυγχάνουμε την εκκένωση του buffer 
    player=getchar(); //είσοδος εντολής-απόφασης του παίκτη απο το stdin του προγράμματος μέσω της συνάρτησης εισόδου getchar
    /*το πρόγραμμα τερματίζει με κωδικό εξόδου το 0 όταν η είσοδος του χρήστη είναι EOF,δηλαδή πατώντας ctrl+D ή όταν ο αριθμός
    των γύρων έχει ξεπεράσει το ανώτατο επιτρεπτό όριο*/

    while((player!=EOF)&&(rounds<MAX)){ 
        rounds++;
        if((player!='C')&&(player!='D')){ //σε περίπτωση λάθος εισόδου πέρα απο EOF και D,C
            rounds--; 
            player=getchar();
            continue; 
            /*με αυτόν τον  τρόπο και σε συνδυασμό με την μείωση των γύρων κατά ένα ο συγκεκριμένος γύρος επαναλαμβάνεται
            χωρίς να υπάρχει κάποια αύξηση στο τελικό πλήθος των γύρων και κατα συνέπεια στην συνθήκη τερματισμού του προγράμματος
            που αφορά το ανώτατο πλήθος αυτών των γύρων*/
        }
        if(rounds<MAX){ /*με αυτόν τον τρόπο αποφεύγεται η είσοδος χαρακτήρα-εντολής του χρήστη/παίκτη σε περίπτωση που το πλήθος
        των γύρων έχει ξεπεράσει το ανώτατο όριο*/
          if(!(rounds%10)){
            putchar('C');/*με αυτόν τον τρόπο αφενός εξασφαλίζουμε ότι εκτυπώνει ανά 1000 γύρους τουλάχιστον μια φορά D και μια φορά C
            και αφετέρου στοχεύει στον αιφνιδιασμό του αντιπάλου*/
            putchar('\n');
            fflush(stdout);
          }
          else{
            putchar(me); 
            /*επομένως εκτυπώνουμε κατά βάση τον χαρακτήρα-εντολή D και ανα 10 γύρους εκτυπώνουμε τον χαρακτήρα-εντολή C για τους λόγους 
            που αναφέρονται παραπάνω */
            putchar('\n');
            fflush(stdout);
          }
        player=getchar();}
    }
    return 0;//exit code του προγράμματος
}